var image = 'rare.png';

var category = {
	 gratefairy:0 		// 精靈王
	,burstdragon:1		// 機械龍
	,nightsofrounds1:2 	// 圓桌騎士
	,nightsofrounds2:3 	// 圓桌騎士
	,genius:4 			// 天才
	,burstgirl:5		// 機械娘
	,wizardofoz:6		// 綠野仙蹤
	,secondbeast:7		// 拘束獸
	,sdf:8				// 特務龍
	,demonicgeneral:9	// 六魔將
	,shakespeare:10		// 聖劇之戲曲
	,nordisk:11         // 北歐神
	,rokuhara:12        // 六波羅
	,psychics:13        // 六神通
	,effect:14          // 調聖者
	,council:15         // 新世界評議會
	,number:16			// 數字
	,weather:17			// 天氣術師
	,painter:18			// 六畫伯
	,god:19				// 神獸者
	,twins:20			// 雙子
	,muses:21			// 三藝神=繆思
	,dragon:22			// 裏古龍眾
	,miko:23			// 創醒之巫女
	,beast:24			// 魔獸士
	,limited1:100		// 限定
	,limited2:101		// 限定
	,limited3:102		// 限定
	,limited4:103		// 限定
	,limited5:104		// 限定
	,limited6:105		// 限定
	,limited7:106		// 限定
	,realLimited1:190	// 真限
	,season1:200		// 節日限定
	,swimsuit1:201		// 水著
	,swimsuit2:202		// 水著
	,bd2016:203			// BD 2016
	,bd20162:204		// BD 2016
	,NUM:38				// Total
};

var cateLine = [
    [2,3]
    ,[24,25,26,27,28,29,30]
    ,[33,34]
	,[35,36]
]

var element = {
	 fire:0
	,aqua:1
	,wind:2
	,light:3
	,dark:4
	,none:5
	,NUM:6
};

var numbers = [
	 'gratefairy'
	,'burstdragon'
	,'nightsofrounds1'
	,'nightsofrounds2'
	,'genius'
	,'burstgirl'
	,'wizardofoz'
	,'secondbeast'
	,'sdf'
	,'demonicgeneral'
	,'shakespeare'
	,'nordisk'
	,'rokuhara'
	,'psychics'
	,'effect'
	,'council'
	,'number'
	,'weather'
	,'painter'
	,'god'
	,'twins'
	,'muses'
    ,'dragon'
	,'miko'
	,'beast'
	,'limited1'
	,'limited2'
	,'limited3'
	,'limited4'
	,'limited5'
	,'limited6'
	,'limited7'
	,'realLimited1'
	,'season1'
	,'swimsuit1'
	,'swimsuit2'
	,'bd2016'
	,'bd20162'
];

var unit = {
	gratefairy:[
		 '0,0'
		,'1,1'
		,'2,2'
		,'3,3'
		,'4,4'
		,'5,5'
	]

	,burstdragon:[
		 '6,0'
		,'7,1'
		,'8,2'
		,'9,3'
		,'10,4'
		,'11,5'
	]

	,nightsofrounds1:[
		 '12,0'
		,'13,1'
		,'14,2'
		,'15,3'
		,'16,4'
		,'17,5'
	]
	,nightsofrounds2:[
		 '18,0'
		,'19,1'
		,'20,2'
		,'21,3'
		,'22,4'
		,'23,5'
	]

	,genius:[
		 '24,0'
		,'25,1'
		,'26,2'
		,'27,3'
		,'28,4'
		,'29,5'
	]

	,burstgirl:[
		 '30,0'
		,'31,1'
		,'32,2'
		,'33,3'
		,'34,4'
		,'35,5'
	]

	,wizardofoz:[
		 '36,0'
		,'37,1'
		,'38,2'
		,'39,3'
		,'40,4'
		,'41,5'
	]

	,secondbeast:[
		 '42,0'
		,'43,1'
		,'44,2'
		,'45,3'
		,'46,4'
		,'47,5'
	]

	,sdf:[
		 '48,0'
		,'49,1'
		,'50,2'
		,'51,3'
		,'52,4'
		,'53,5'
	]

	,demonicgeneral:[
		 '54,0'
		,'55,1'
		,'56,2'
		,'57,3'
		,'58,4'
		,'59,5'
	]

	,shakespeare:[
		 '60,0'
		,'61,1'
		,'62,2'
		,'63,3'
		,'64,4'
		,'65,5'
	]

	,nordisk:[
		 '66,0'
		,'67,1'
		,'68,2'
		,'69,3'
		,'70,4'
		,'71,5'
	]

	,rokuhara:[
		 '72,0'
		,'73,1'
		,'74,2'
		,'75,3'
		,'76,4'
		,'77,5'
	]

	,psychics:[
		 '78,0'
		,'79,1'
		,'80,2'
		,'81,3'
		,'82,4'
		,'83,5'
	]

	,effect:[
		 '84,0'
		,'85,1'
		,'86,2'
		,'87,3'
		,'88,4'
		,'89,5'
	]

	,council:[
		 '90,0'
		,'91,1'
		,'92,2'
		,'93,3'
		,'94,4'
		,'95,5'
	]

	,number:[
		 '96,0'
		,'97,1'
		,'98,2'
		,'99,3'
		,'100,4'
		,'101,5'
	]

	,weather:[
		 '102,0'
		,'103,1'
		,'104,2'
		,'105,3'
		,'106,4'
		,'107,5'
	]

	,painter:[
		 '108,0'
		,'109,1'
		,'110,2'
		,'111,3'
		,'112,4'
		,'113,5'
	]

	,god:[
		 '114,0'
		,'115,1'
		,'116,2'
		,'117,3'
		,'118,4'
		,'119,5'
	]

	,twins:[
		 ''
		,''
		,''
		,''
		,'546,4'
		,'547,5'
	]

	,muses:[
		 '120,0'
		,'121,1'
		,'122,2'
		,''
		,''
		,''
	]

	,dragon:[
		 ''
		,''
		,''
		,'539,3'
		,'540,4'
		,'541,5'
	]

	,miko:[
		''
		,''
		,''
		,'567,3'
		,'568,4'
		,'569,5'
	]

	,beast:[
		'580,0'
		,'581,1'
		,'582,2'
		,''
		,''
		,''
	]

	,limited1:[
		 '500,0'
		,'501,1'
		,'502,2'
		,'503,3'
		,'504,4'
		,'505,5'
	]

	,limited2:[
		 '506,0'
		,'507,1'
		,'508,2'
		,'509,3'
		,'510,4'
		,'511,5'
	]

	,limited3:[
		 '512,0'
		,'513,1'
		,'514,2'
		,'515,3'
		,'516,4'
		,'573,5'
	]

	,limited4:[
		 '528,0'
		,'530,1'
		,'527,2'
		,'517,3'
		,'526,4'
		,'529,5'
	]

	,limited5:[
		 '578,0'
		,'544,1'
		,'542,2'
		,'534,3'
		,'532,4'
		,''
	]

	,limited6:[
		 ''
		,'583,1'
		,'570,2'
		,''
		,'572,4'
		,''
	]

	,limited7:[
		 ''
		,''
		,'579,2'
		,''
		,'574,4'
		,''
	]

	,realLimited1:[
		 '543,0'
		,''
		,'535,2'
		,'575,3'
		,'545,4'
		,'576,5'
	]


	,season1:[
		 '518,0'
		,'519,1'
		,'520,2'
		,'521,3'
		,'522,4'
		,'523,5'
	]

	,swimsuit1:[
		 '548,0'
		,'549,1'
		,'560,2'
		,'561,3'
		,'562,4'
		,'563,5'
	]

	,swimsuit2:[
		 '564,0'
		,'524,1'
		,'565,2'
		,'525,3'
		,'566,4'
		,''
	]

	,bd2016:[
		 '536,0'
		,'538,1'
		,'571,2'
		,'531,3'
		,'537,4'
		,'533,5'
	]

	,bd20162:[
		 ''
		,''
		,''
		,'577,3'
		,''
		,''
	]
};
//next: 584
